emacs/config.org
#+TITLE: Char's GNU Emacs Config
#+AUTHOR: Char :3
#+DESCRIPTION: Char's personal Emacs config.
#+STARTUP: showeverything 
#+OPTIONS: toc:2

* Table of Contents :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#elpaca-package-manager][Elpaca Package Manager]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
- [[#fonts][Fonts]]
  - [[#setting-the-font-face][Setting the Font Face]]
- [[#graphical-user-interface-tweaks][GRAPHICAL USER INTERFACE TWEAKS]]
  - [[#disable-menubar-toolbars-scrollbars][Disable Menubar, Toolbars, Scrollbars]]
  - [[#display-line-numbers-relative--truncated-lines][Display line numbers (relative) & truncated lines]]
- [[#which-key][WHICH-KEY]]
- [[#org-mode][ORG MODE]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#add-pretty-bullets][Add pretty bullets]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
- [[#editing][Editing]]
  - [[#sudo-edit][Sudo Edit]]
- [[#regular-keybinds][Regular Keybinds]]
  - [[#zooming-inout][Zooming In/Out]]

* IMPORTANT PROGRAMS TO LOAD FIRST
** Elpaca Package Manager

#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.12)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-sources-directory (expand-file-name "sources/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca-activate)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-sources-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install use-package support
  (elpaca elpaca-use-package
    (elpaca-use-package-mode))

  ;; Optional: faster parallel installs
  (setq elpaca-queue-limit 30)
#+end_src

** Load Evil Mode

#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :defer nil
    :init
    (setq evil-want-integration t
          evil-want-keybinding nil
          evil-vsplit-window-right t
          evil-split-window-below t)
    :config
    (evil-mode))

  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (setq evil-collection-mode-list '(dashboard dired ibuffer))
    (evil-collection-init))
#+end_src

** General Keybindings

#+begin_src emacs-lisp
  (defvar char/emacs-config-org
    (expand-file-name "config.org" user-emacs-directory))

  (use-package general
    :ensure t
    :after evil
    :demand t
    :config
    (general-evil-setup))
  (elpaca-wait)

    ;; set up 'SPC' as the global leader key
    (general-create-definer char/leader-keys
      :states '(normal visual)
      :keymaps 'override
      :prefix "SPC"
      :global-prefix "M-SPC")

      ;; Buffer keys
    (defun char/open-scratch-buffer ()
      (interactive)
      (switch-to-buffer (get-buffer-create "*scratch*")))
    (char/leader-keys
      "b" '(:ignore t :wk "buffer")
      "bb" '(switch-to-buffer :wk "Switch buffer")
      "bk" '(kill-current-buffer :wk "Kill current buffer")
      "bn" '(next-buffer :wk "Next buffer")
      "bp" '(previous-buffer :wk "Previous buffer")
      "br" '(revert-buffer :wk "Reload buffer")
      "bi" '(ibuffer :wk "Ibuffer")
      "bs" '(char/open-scratch-buffer :wk "Open Scratch"))

      ;; File keys
    (defun char/find-org-config ()
      (interactive)
      (find-file char/emacs-config-org))
    (defun char/reload-config ()
      (interactive)
      (org-babel-tangle-file char/emacs-config-org)
      (load-file (expand-file-name "init.el" user-emacs-directory)))
    (char/leader-keys
      "f" '(:ignore t :wk "File")
      "ff" '(find-file :wk "Find File")
      "fo" '(:ignore t :wk "Open File")
      "foc" '(char/find-org-config :wk "Org Config")
      "fr" '(char/reload-config :wk "Reload Config"))

      ;; Help keys
    (char/leader-keys
      "h" '(:ignore t :wk "Help")
      "hk" '(describe-key :wk "Describe Key")
      "hc" '(describe-key-briefly :wk "Describe Key Briefly")
      "hx" '(describe-command :wk "Describe Command")
      "hf" '(describe-function :wk "Describe Function")
      "hv" '(describe-variable :wk "Describe Variable")
      "h?" '(help-for-help :wk "Help For Help"))

    ;; Eval keys
    (char/leader-keys
    "e" '(:ignore t :wk "Evaluate")
    "eb" '(eval-buffer :wk "Evaluate Elisp in Buffer")
    "ed" '(eval-defun :wk "Evaluate Defun Containing or After Point")
    "ee" '(eval-expression :wk "Evaluate an Elisp Expression")
    "el" '(eval-last-sexp :wk "Evaluate Elisp Expression Before Point")
    "er" '(eval-region :wk "Evaluate Elisp in Region"))

  ;; Editing keys
  (char/leader-keys
    "i" '(:ignore t :wk "Edit")
    "ic" '(comment-line :wk "Toggle comment"))
#+end_src

* Fonts
Defining the various fonts that emacs will use

** Setting the Font Face

#+begin_src emacs-lisp
  (set-face-attribute 'default nil
  		    :font "JetBrains Mono"
  		    :height 110
  		    :weight 'medium)
  (set-face-attribute 'variable-pitch nil
  		    :font "JetBrains Mono"
  		    :height 120
  		    :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
  		    :font "JetBrains Mono"
  		    :height 110
  		    :weight 'medium)
  ;; Makes commented text italicized (is that a real word?).
  ;; Your font must have an italic face available.
  (set-face-attribute 'font-lock-comment-face nil
  		    :slant 'italic)

  ;; This sets the default font on all graphical frames created after restarting Emacs.
  ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
  ;; are not right unless I also add this method of setting the default font.
  (add-to-list 'default-frame-alist '(font . "JetBrains Mono-11"))

  ;; Uncomment the following line if line spacing needs adjusting.
  (setq-default line-spacing 0.12)

#+end_src


* GRAPHICAL USER INTERFACE TWEAKS

** Disable Menubar, Toolbars, Scrollbars
#+begin_src emacs-lisp
(menu-bar-mode 0)
(tool-bar-mode 0)
(scroll-bar-mode 0)
#+end_src

** Display line numbers (relative) & truncated lines
#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative)
  (global-visual-line-mode t)
#+end_src

* WHICH-KEY
#+begin_src emacs-lisp
  (use-package which-key
    :init
      (which-key-mode 1)
    :config
    (setq which-key-side-window-location 'bottom
	  which-key-sort-order #'which-key-key-order-alpha
	  which-key-sort-uppercase-first nil
	  which-key-add-column-padding 1
	  which-key-max-display-columns nil
	  which-key-min-display-lines 6
	  which-key-side-window-slot -10
	  which-key-side-window-max-height 0.25
	  which-key-idle-delay 0.8
	  which-key-max-description-length 45
	  which-key-allow-imprecise-window-fit t
	  which-key-separator " → " ))
#+end_src

* ORG MODE
** Enabling Table of Contents
#+begin_src emacs-lisp
(use-package toc-org
  :ensure t
  :hook (org-mode . toc-org-enable))
#+end_src

** Add pretty bullets
#+begin_src emacs-lisp
(use-package org-bullets
  :ensure t
  :hook (org-mode . org-bullets-mode))
#+end_src

** Disable Electric Indent
Get rid of the annoying src block indentation
#+begin_src emacs-lisp
  (electric-indent-mode 0)
#+end_src

** Source Code Block Tag Expansion
Org-tempo is not a separate package but a module within org that can be enabled.  Org-tempo allows for '<s' followed by TAB to expand to a begin_src tag.  Other expansions available include:

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |


#+begin_src emacs-lisp
(require 'org-tempo)
#+end_src


* Editing

** Sudo Edit

#+begin_src emacs-lisp
  (use-package sudo-edit
    :ensure t
    :config
    (char/leader-keys
      "fu" '(sudo-edit-find-file :wk "Sudo Find File")
      "fU" '(sudo-edit :wk "Sudo Edit File")))
#+end_src

* Regular Keybinds

** Zooming In/Out
*** Zooming In/Out
#+begin_src emacs-lisp
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
#+end_src
